# Basic Pandas Data Structure

In [3]:
import pandas as pd

In [4]:
# Series can be created from Python dict, arrays, or scalar values (like 1, 2, 3, etc.)
# To create a series, we can use the .Series() function.

# Creating a series from a Python list
s = pd.Series([1, 3, 5, 7, 9])
print(s)

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [5]:
# Creating a series from a Python dict
d = {'a': 1, 'b': 3, 'c': 5, 'd': 7, 'e': 9}
s = pd.Series(d)
s

a    1
b    3
c    5
d    7
e    9
dtype: int64

In [6]:
# Creating a .Series() has Index and name parameters that can be set.
s = pd.Series([1, 2, 3, 4, 5], index=['a', 'b', 'c', 'd', 'e'], name='example series')
s

a    1
b    2
c    3
d    4
e    5
Name: example series, dtype: int64

In [7]:
# DataFrame can be created from a Python dictionary, list, 2D array, object series, etc. Create
# using the .DataFrame() function.

# creating an empty DataFrame object and add columns and rows to it.
df1 = pd.DataFrame()
print(df1)

df1['name'] = ['John', 'Paul', 'George', 'Ringo']
df1['grade'] = [90, 80, 70, 60]
df1

Empty DataFrame
Columns: []
Index: []

     name  grade
0    John     90
1    Paul     80
2  George     70
3   Ringo     60

In [8]:
# Creating a DataFrame from a Python dictionary
dictionary = {
    'name': ['John', 'Paul', 'George', 'Ringo'],
    'grade': [90, 80, 70, 60],
}

df2 = pd.DataFrame(dictionary)
df2

     name  grade
0    John     90
1    Paul     80
2  George     70
3   Ringo     60

In [9]:
# Creating from a list, in which we can specify the column names.
a = [10, 20, 30, 40]
b = [50, 60, 70, 80]
c = [90, 100, 110, 120]

df3 = pd.DataFrame([a,b,c], columns=list("abcd"))

df3

    a    b    c    d
0  10   20   30   40
1  50   60   70   80
2  90  100  110  120

In [10]:
# Get the statistics of DataFrame
# The .describe() function is used to get the statistics of the DataFrame.
df3.describe()

          a      b      c      d
count   3.0    3.0    3.0    3.0
mean   50.0   60.0   70.0   80.0
std    40.0   40.0   40.0   40.0
min    10.0   20.0   30.0   40.0
25%    30.0   40.0   50.0   60.0
50%    50.0   60.0   70.0   80.0
75%    70.0   80.0   90.0  100.0
max    90.0  100.0  110.0  120.0

In [11]:
# DataFrame.info() is a function of DataFrame that gives metadata of DataFrame
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       3 non-null      int64
 3   d       3 non-null      int64
dtypes: int64(4)
memory usage: 224.0 bytes

# Working with Rows and Columns

In [12]:
# Working with Rows and Columns
# We will create a dummy dataset from a random integer number using the NumPy package.
import numpy as np

np.random.seed(0)
data = np.random.randint(0, 100, size=(5, 5)) # 5 rows and 5 columns

# Create a DataFrame from the data
df = pd.DataFrame(data, columns=list('abcde'))
df

    a   b   c   d   e
0  44  47  64  67  67
1   9  83  21  36  87
2  70  88  88  12  58
3  65  39  87  46  88
4  81  37  25  77  72

In [13]:
# get brief information about the DataFrame
print(df.index)
print(df.columns)

RangeIndex(start=0, stop=5, step=1)
Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

## .drop()

In [14]:
print('Original DataFrame')
df

Original DataFrame

    a   b   c   d   e
0  44  47  64  67  67
1   9  83  21  36  87
2  70  88  88  12  58
3  65  39  87  46  88
4  81  37  25  77  72

In [15]:
# Drop rows from the DataFrame
df.drop(index=[4], columns=['c', 'd'], inplace=True)

In [16]:
print('DataFrame after dropping rows and columns')
df

DataFrame after dropping rows and columns

    a   b   e
0  44  47  67
1   9  83  87
2  70  88  58
3  65  39  88

# Indexing, Slicing, and Selecting a Subset of Data

In [17]:
np.random.seed(0)
data = np.random.randint(0, 100, size=(10, 4)) # 10 rows and 4 columns
df = pd.DataFrame(data, columns=list('abcd'))
df

    a   b   c   d
0  44  47  64  67
1  67   9  83  21
2  36  87  70  88
3  88  12  58  65
4  39  87  46  88
5  81  37  25  77
6  72   9  20  80
7  69  79  47  64
8  82  99  88  49
9  29  19  19  14

## selecting columns df['column_name']

In [18]:
df['a']

0    44
1    67
2    36
3    88
4    39
5    81
6    72
7    69
8    82
9    29
Name: a, dtype: int32

## selecting multiple columns df[['column_name1', 'column_name2']]

In [19]:
df[['a', 'c']]

    a   c
0  44  64
1  67  83
2  36  70
3  88  58
4  39  46
5  81  25
6  72  20
7  69  47
8  82  88
9  29  19

## selecting rows by label df.loc['row_label']

In [20]:
df.iloc[1]

a    67
b     9
c    83
d    21
Name: 1, dtype: int32

## selecting slice of rows

In [21]:
df.iloc[1:8]

    a   b   c   d
1  67   9  83  21
2  36  87  70  88
3  88  12  58  65
4  39  87  46  88
5  81  37  25  77
6  72   9  20  80
7  69  79  47  64

# selecting rows by boolean vector

In [22]:
# Select rows where column 'a' is greater than 50
df[df['a'] > 50]

    a   b   c   d
1  67   9  83  21
3  88  12  58  65
5  81  37  25  77
6  72   9  20  80
7  69  79  47  64
8  82  99  88  49

In [23]:
# Select rows where column 'a' is greater than 50 and column 'b' is greater than 50
df[(df['a'] > 50) & (df['b'] > 50)]

    a   b   c   d
7  69  79  47  64
8  82  99  88  49

# Splitting data

# Split the DataFrame using .iloc[] by rows

In [24]:
print('default DataFrame')
df

default DataFrame

    a   b   c   d
0  44  47  64  67
1  67   9  83  21
2  36  87  70  88
3  88  12  58  65
4  39  87  46  88
5  81  37  25  77
6  72   9  20  80
7  69  79  47  64
8  82  99  88  49
9  29  19  19  14

# Split the DataFrame using .iloc[] by rows

In [25]:
df1 = df.iloc[:5, :] # :5 means splitting rows from index 0 to 4
df1

    a   b   c   d
0  44  47  64  67
1  67   9  83  21
2  36  87  70  88
3  88  12  58  65
4  39  87  46  88

In [26]:
df2 = df.iloc[5:, :] # 5: means splitting rows from index 5 to the end
df2

    a   b   c   d
5  81  37  25  77
6  72   9  20  80
7  69  79  47  64
8  82  99  88  49
9  29  19  19  14

# Split the DataFrame using .iloc[] by columns

In [27]:
df3 = df.iloc[:, :2] # :2 means splitting columns from index 0 to 2
df3

    a   b
0  44  47
1  67   9
2  36  87
3  88  12
4  39  87
5  81  37
6  72   9
7  69  79
8  82  99
9  29  19

In [28]:
df4 = df.iloc[:, 2:] # 2: means splitting columns from index 2 to the end
df4

    c   d
0  64  67
1  83  21
2  70  88
3  58  65
4  46  88
5  25  77
6  20  80
7  47  64
8  88  49
9  19  14

## # split the dictionary data

In [29]:
tech_companies = {
    'brand': ['Apple', 'Google', 'Microsoft', 'Amazon', 'Facebook', 'Twitter', 'Alibaba', 'Tencent'],
    'founded': [1976, 1998, 1975, 1994, 2004, 2006, 1999, 1998],
    'ceo': ['Tim Cook', 'Sundar Pichai', 'Satya Nadella', 'Jeff Bezos', 'Mark Zuckerberg', 'Jack Dorsey', 'Daniel Zhang', 'Ma Huateng'],
    'industry': ['Hardware', 'Search Engine', 'Software', 'E-commerce', 'Social Media', 'Social Media', 'E-commerce', 'Social Media']
}

df = pd.DataFrame(tech_companies)
df

       brand  founded              ceo       industry
0      Apple     1976         Tim Cook       Hardware
1     Google     1998    Sundar Pichai  Search Engine
2  Microsoft     1975    Satya Nadella       Software
3     Amazon     1994       Jeff Bezos     E-commerce
4   Facebook     2004  Mark Zuckerberg   Social Media
5    Twitter     2006      Jack Dorsey   Social Media
6    Alibaba     1999     Daniel Zhang     E-commerce
7    Tencent     1998       Ma Huateng   Social Media

In [30]:
# Split the DataFrame using .iloc[] by rows
df1 = df.iloc[:2, :] # :3 means splitting rows from index 0 to 2
df1

    brand  founded            ceo       industry
0   Apple     1976       Tim Cook       Hardware
1  Google     1998  Sundar Pichai  Search Engine

In [31]:
df2 = df.iloc[2:, :] # 3: means splitting rows from index 3 to the end
df2

       brand  founded              ceo      industry
2  Microsoft     1975    Satya Nadella      Software
3     Amazon     1994       Jeff Bezos    E-commerce
4   Facebook     2004  Mark Zuckerberg  Social Media
5    Twitter     2006      Jack Dorsey  Social Media
6    Alibaba     1999     Daniel Zhang    E-commerce
7    Tencent     1998       Ma Huateng  Social Media

In [32]:
# Split the DataFrame using .iloc[] by columns
df3 = df.iloc[:, :2] # :2 means splitting columns from index 0 to 2
df3

       brand  founded
0      Apple     1976
1     Google     1998
2  Microsoft     1975
3     Amazon     1994
4   Facebook     2004
5    Twitter     2006
6    Alibaba     1999
7    Tencent     1998

In [33]:
df4 = df.iloc[:, 2:] # 2: means splitting columns from index 2 to the end
df4

               ceo       industry
0         Tim Cook       Hardware
1    Sundar Pichai  Search Engine
2    Satya Nadella       Software
3       Jeff Bezos     E-commerce
4  Mark Zuckerberg   Social Media
5      Jack Dorsey   Social Media
6     Daniel Zhang     E-commerce
7       Ma Huateng   Social Media

## split DataFrame using .groupby()

In [34]:
grouped = df.groupby('industry')
grouped.groups

{'E-commerce': [3, 6], 'Hardware': [0], 'Search Engine': [1], 'Social Media': [4, 5, 7], 'Software': [2]}

In [35]:
grouped.get_group('E-commerce')

     brand  founded           ceo    industry
3   Amazon     1994    Jeff Bezos  E-commerce
6  Alibaba     1999  Daniel Zhang  E-commerce

In [36]:
grouped.get_group('Social Media')

      brand  founded              ceo      industry
4  Facebook     2004  Mark Zuckerberg  Social Media
5   Twitter     2006      Jack Dorsey  Social Media
7   Tencent     1998       Ma Huateng  Social Media

## Split the DataFrame using .sample() (shuffle rows)

In [37]:
# n = number of rows to return
df6 = df.sample(n=2)
df6

       brand  founded            ceo    industry
2  Microsoft     1975  Satya Nadella    Software
3     Amazon     1994     Jeff Bezos  E-commerce

In [38]:
# frac means the fraction of rows to return
df7 = df.sample(frac=0.5)
df7

     brand  founded            ceo       industry
1   Google     1998  Sundar Pichai  Search Engine
6  Alibaba     1999   Daniel Zhang     E-commerce
0    Apple     1976       Tim Cook       Hardware
7  Tencent     1998     Ma Huateng   Social Media

# Merge data

Use .concat() in pandas works by combining Dataframes across rows
or columns. We can concat two or more data frames either along
rows (axis=0) or along columns (axis=1)

In [39]:
# DataFrame Left
left = pd.DataFrame({
    "A": ["A0", "A1", "A2"],
    "B": ["B0", "B1", "B2"]
}, index=["K0", "K1", "K2"])

# DataFrame right
right = pd.DataFrame({
    "C": ["C0", "C2", "C3"],
    "D": ["D0", "D2", "D3"]
}, index=["K0", "K2", "K3"])

# no axis specified, so it will concatenate vertically
concat = pd.concat([left, right])
concat

      A    B    C    D
K0   A0   B0  NaN  NaN
K1   A1   B1  NaN  NaN
K2   A2   B2  NaN  NaN
K0  NaN  NaN   C0   D0
K2  NaN  NaN   C2   D2
K3  NaN  NaN   C3   D3

In [40]:
# Axis=0 means concatenate vertically
concat1 = pd.concat([left, right], axis=0)
concat1

      A    B    C    D
K0   A0   B0  NaN  NaN
K1   A1   B1  NaN  NaN
K2   A2   B2  NaN  NaN
K0  NaN  NaN   C0   D0
K2  NaN  NaN   C2   D2
K3  NaN  NaN   C3   D3

In [41]:
# Axis=1 means concatenate horizontally
concat2 = pd.concat([left, right], axis=1)
concat2

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

Merging two DataFrames on "column" using .merge()

In [42]:
# Create a DataFrame for employees
df_employees = pd.DataFrame({
    'employee_id': [1, 2, 3, 4],
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'department': ['HR', 'IT', 'Finance', 'Marketing']
})

# Create a DataFrame for salaries
df_salaries = pd.DataFrame({
    'employee_id': [1, 2, 3, 4],
    'salary': [70000, 80000, 90000, 85000]
})

print('Employee DataFrame')
print(df_employees)

print('Salaries DataFrame')
print(df_salaries)

# Merge the DataFrames
df_merged = pd.merge(df_employees, df_salaries, on='employee_id')
df_merged

Employee DataFrame
   employee_id     name department
0            1    Alice         HR
1            2      Bob         IT
2            3  Charlie    Finance
3            4    David  Marketing
Salaries DataFrame
   employee_id  salary
0            1   70000
1            2   80000
2            3   90000
3            4   85000

   employee_id     name department  salary
0            1    Alice         HR   70000
1            2      Bob         IT   80000
2            3  Charlie    Finance   90000
3            4    David  Marketing   85000

Use .merge() to merge DataFrames by matching their
index. The value of left_index and right_index
parameters of .merge() should be True.

In [43]:
df1 = pd.DataFrame({'Courses': ["Spark", "PySpark", "Python", "pandas"],
                    'Fee': [20000, 25000, 22000, 24000]},
                   index=['r1', 'r2', 'r3', 'r4'])

df2 = pd.DataFrame({'Duration': ['30day', '40days', '35days', '60days', '55days'],
                    'Discount': [1000, 2300, 2500, 2000, 3000]},
                   index=['r1', 'r2', 'r3', 'r5', 'r6'])

print('DataFrame 1')
print(df1)
print()
print('DataFrame 2')
print(df2)

# Merge two DataFrames by index using pandas.merge()
result = pd.merge(df1, df2, left_index=True, right_index=True)
result

DataFrame 1
    Courses    Fee
r1    Spark  20000
r2  PySpark  25000
r3   Python  22000
r4   pandas  24000

DataFrame 2
   Duration  Discount
r1    30day      1000
r2   40days      2300
r3   35days      2500
r5   60days      2000
r6   55days      3000

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300
r3   Python  22000   35days      2500

.join(), is a convenient method for combining the columns of two potentially differently-indexed
DataFrames into a single result DataFrame

In [44]:
left = pd.DataFrame({"A": ["A0", "A1", "A2"], "B": ["B0", "B1", "B2"]}, index=["K0", "K1", "K2"])
right = pd.DataFrame({"C": ["C0", "C2", "C3"], "D": ["D0", "D2", "D3"]}, index=["K0", "K2", "K3"])

print('left')
print(left)
print()
print('right')
print(right)

result = left.join(right)
result

left
     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

right
     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

join() takes an optional on argument which may be a column or multiple column names, which
specifies that the passed DataFrame is to be aligned on that column in the DataFrame

In [45]:
left = pd.DataFrame(
 { "A": ["A0", "A1", "A2", "A3"],
   "B": ["B0", "B1", "B2", "B3"],
   "key": ["K0", "K1", "K0", "K1"], })
right = pd.DataFrame({"C": ["C0", "C1"], "D": ["D0", "D1"]}, index=["K0", "K1"])

print('left')
print(left)
print()
print('right')
print(right)

result = left.join(right, on="key")
result

left
    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K0
3  A3  B3  K1

right
     C   D
K0  C0  D0
K1  C1  D1

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K0  C0  D0
3  A3  B3  K1  C1  D1

# Missing values handling

In [58]:
# Original data with missing values
data = {
    'time': ['10:00', '11:00', '12:00', '13:00', '14:00', '15:00', '16:00', '17:00', '18:00', '19:00'],
    'temperature': [20, 21, 22, np.nan, 24, 25, np.nan, 27, 28, np.nan],
    'humidity': [56, 57, 58, 59, np.nan, 61, 62, np.nan, 64, 65],
}

df = pd.DataFrame(data)

In [59]:
print("Original Orders DataFrame:")
df

Original Orders DataFrame:

    time  temperature  humidity
0  10:00         20.0      56.0
1  11:00         21.0      57.0
2  12:00         22.0      58.0
3  13:00          NaN      59.0
4  14:00         24.0       NaN
5  15:00         25.0      61.0
6  16:00          NaN      62.0
7  17:00         27.0       NaN
8  18:00         28.0      64.0
9  19:00          NaN      65.0

In [60]:
# Check for missing values
df.isnull()

    time  temperature  humidity
0  False        False     False
1  False        False     False
2  False        False     False
3  False         True     False
4  False        False      True
5  False        False     False
6  False         True     False
7  False        False      True
8  False        False     False
9  False         True     False

In [61]:
# Check for missing values in a specific column
df.isnull().sum()

time           0
temperature    3
humidity       2
dtype: int64

In [62]:
# Removing the data with missing values
df1 = df.dropna()
df1

    time  temperature  humidity
0  10:00         20.0      56.0
1  11:00         21.0      57.0
2  12:00         22.0      58.0
5  15:00         25.0      61.0
8  18:00         28.0      64.0

In [63]:
# Replace missing values with a specific value
df2 = df.fillna(0)
df2

    time  temperature  humidity
0  10:00         20.0      56.0
1  11:00         21.0      57.0
2  12:00         22.0      58.0
3  13:00          0.0      59.0
4  14:00         24.0       0.0
5  15:00         25.0      61.0
6  16:00          0.0      62.0
7  17:00         27.0       0.0
8  18:00         28.0      64.0
9  19:00          0.0      65.0

In [68]:
# Replace missing values with the mean of the column
df3 = df
df3['temperature'] = df3['temperature'].fillna(df3['temperature'].mean())
df3['humidity'] = df3['humidity'].fillna(df3['humidity'].mean())
df3

    time  temperature  humidity
0  10:00    20.000000     56.00
1  11:00    21.000000     57.00
2  12:00    22.000000     58.00
3  13:00    23.857143     59.00
4  14:00    24.000000     60.25
5  15:00    25.000000     61.00
6  16:00    23.857143     62.00
7  17:00    27.000000     60.25
8  18:00    28.000000     64.00
9  19:00    23.857143     65.00

In [69]:
# Replace missing values with the median of the column
df4 = df
df4['temperature'] = df4['temperature'].fillna(df4['temperature'].median())
df4['humidity'] = df4['humidity'].fillna(df4['humidity'].median())
df4

    time  temperature  humidity
0  10:00    20.000000     56.00
1  11:00    21.000000     57.00
2  12:00    22.000000     58.00
3  13:00    23.857143     59.00
4  14:00    24.000000     60.25
5  15:00    25.000000     61.00
6  16:00    23.857143     62.00
7  17:00    27.000000     60.25
8  18:00    28.000000     64.00
9  19:00    23.857143     65.00

In [70]:
# Replace missing values with the mode of the column
df5 = df
df5['temperature'] = df5['temperature'].fillna(df5['temperature'].mode()[0])
df5['humidity'] = df5['humidity'].fillna(df5['humidity'].mode()[0])
df5

    time  temperature  humidity
0  10:00    20.000000     56.00
1  11:00    21.000000     57.00
2  12:00    22.000000     58.00
3  13:00    23.857143     59.00
4  14:00    24.000000     60.25
5  15:00    25.000000     61.00
6  16:00    23.857143     62.00
7  17:00    27.000000     60.25
8  18:00    28.000000     64.00
9  19:00    23.857143     65.00